# LineLightShape Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLightShape Class
Members See Also
---
This class encapsulates a line light shape.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class LineLightShape : LightShape
```

Visual Basic
---
```text
Public Class LineLightShape _
	Inherits LightShape
```

Visual C++
---
```text
public ref class LineLightShape : public LightShape
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightShape Autodesk.Revit.DB.Lighting..::..LineLightShape
# See Also
LineLightShape Members
Autodesk.Revit.DB.Lighting Namespace